/* automatically generated by rust-bindgen */

pub const SAMPLE_RATE_TOO_HIGH: ::std::os::raw::c_uint = 1001;
pub const SAMPLE_RATE_TOO_HIGH_MESSAGE: &'static [u8; 43usize] =
    b"HAL: Analog module sample rate is too high\x00";
pub const VOLTAGE_OUT_OF_RANGE: ::std::os::raw::c_uint = 1002;
pub const VOLTAGE_OUT_OF_RANGE_MESSAGE: &'static [u8; 60usize] =
    b"HAL: Voltage to convert to raw value is out of range [0; 5]\x00";
pub const LOOP_TIMING_ERROR: ::std::os::raw::c_uint = 1004;
pub const LOOP_TIMING_ERROR_MESSAGE: &'static [u8; 58usize] =
    b"HAL: Digital module loop timing is not the expected value\x00";
pub const SPI_WRITE_NO_MOSI: ::std::os::raw::c_uint = 1012;
pub const SPI_WRITE_NO_MOSI_MESSAGE: &'static [u8; 50usize] =
    b"HAL: Cannot write to SPI port with no MOSI output\x00";
pub const SPI_READ_NO_MISO: ::std::os::raw::c_uint = 1013;
pub const SPI_READ_NO_MISO_MESSAGE: &'static [u8; 50usize] =
    b"HAL: Cannot read from SPI port with no MISO input\x00";
pub const SPI_READ_NO_DATA: ::std::os::raw::c_uint = 1014;
pub const SPI_READ_NO_DATA_MESSAGE: &'static [u8; 40usize] =
    b"HAL: No data available to read from SPI\x00";
pub const INCOMPATIBLE_STATE: ::std::os::raw::c_uint = 1015;
pub const INCOMPATIBLE_STATE_MESSAGE: &'static [u8; 59usize] =
    b"HAL: Incompatible State: The operation cannot be completed\x00";
pub const NO_AVAILABLE_RESOURCES: ::std::os::raw::c_int = -1004;
pub const NO_AVAILABLE_RESOURCES_MESSAGE: &'static [u8; 40usize] =

    pub fn HAL_GetCounterStopped(counterHandle: HAL_CounterHandle,
                                 status: *mut i32) -> HAL_Bool;
}
extern "C" {
    pub fn HAL_GetCounterDirection(counterHandle: HAL_CounterHandle,
                                   status: *mut i32) -> HAL_Bool;
}
extern "C" {
    pub fn HAL_SetCounterReverseDirection(counterHandle: HAL_CounterHandle,
                                          reverseDirection: HAL_Bool,
                                          status: *mut i32);
}
extern "C" {
    pub fn HAL_InitializeDIOPort(portHandle: HAL_PortHandle, input: HAL_Bool,
                                 status: *mut i32) -> HAL_DigitalHandle;
}
extern "C" {
    pub fn HAL_CheckDIOChannel(channel: i32) -> HAL_Bool;
}
extern "C" {
    pub fn HAL_FreeDIOPort(dioPortHandle: HAL_DigitalHandle);
}
extern "C" {
    pub fn HAL_AllocateDigitalPWM(status: *mut i32) -> HAL_DigitalPWMHandle;
}
extern "C" {
    pub fn HAL_FreeDigitalPWM(pwmGenerator: HAL_DigitalPWMHandle,
                              status: *mut i32);
}
extern "C" {
    pub fn HAL_SetDigitalPWMRate(rate: ::std::os::raw::c_double,
                                 status: *mut i32);
}
extern "C" {
    pub fn HAL_SetDigitalPWMDutyCycle(pwmGenerator: HAL_DigitalPWMHandle,
                                      dutyCycle: ::std::os::raw::c_double,
                                      status: *mut i32);
}
extern "C" {
    pub fn HAL_SetDigitalPWMOutputChannel(pwmGenerator: HAL_DigitalPWMHandle,
                                          channel: i32, status: *mut i32);
}
extern "C" {
    pub fn HAL_SetDIO(dioPortHandle: HAL_DigitalHandle, value: HAL_Bool,
                      status: *mut i32);
}
extern "C" {
    pub fn HAL_GetDIO(dioPortHandle: HAL_DigitalHandle, status: *mut i32)
     -> HAL_Bool;
}
extern "C" {
    pub fn HAL_GetDIODirection(dioPortHandle: HAL_DigitalHandle,
                               status: *mut i32) -> HAL_Bool;
}
extern "C" {
    pub fn HAL_Pulse(dioPortHandle: HAL_DigitalHandle,
                     pulseLength: ::std::os::raw::c_double, status: *mut i32);
}
extern "C" {
    pub fn HAL_IsPulsing(dioPortHandle: HAL_DigitalHandle, status: *mut i32)
     -> HAL_Bool;
}
extern "C" {
    pub fn HAL_IsAnyPulsing(status: *mut i32) -> HAL_Bool;
}
extern "C" {
    pub fn HAL_SetFilterSelect(dioPortHandle: HAL_DigitalHandle,
                               filterIndex: i32, status: *mut i32);
}
extern "C" {
    pub fn HAL_GetFilterSelect(dioPortHandle: HAL_DigitalHandle,
                               status: *mut i32) -> i32;
}
extern "C" {
    pub fn HAL_SetFilterPeriod(filterIndex: i32, value: i64,
                               status: *mut i32);
}
extern "C" {
    pub fn HAL_GetFilterPeriod(filterIndex: i32, status: *mut i32) -> i64;
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct HAL_ControlWord {
    pub _bitfield_1: u32,
    pub __bindgen_align: [u32; 0usize],
}
#[test]
fn bindgen_test_layout_HAL_ControlWord() {
    assert_eq!(::std::mem::size_of::<HAL_ControlWord>() , 4usize , concat ! (
               "Size of: " , stringify ! ( HAL_ControlWord ) ));
    assert_eq! (::std::mem::align_of::<HAL_ControlWord>() , 4usize , concat !
                ( "Alignment of " , stringify ! ( HAL_ControlWord ) ));
}
impl Clone for HAL_ControlWord {
    fn clone(&self) -> Self { *self }
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum HAL_AllianceStationID {
    HAL_AllianceStationID_kRed1 = 0,
    HAL_AllianceStationID_kRed2 = 1,
    HAL_AllianceStationID_kRed3 = 2,
    HAL_AllianceStationID_kBlue1 = 3,
    HAL_AllianceStationID_kBlue2 = 4,
    HAL_AllianceStationID_kBlue3 = 5,
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct HAL_JoystickAxes {
    pub count: i16,
    pub axes: [::std::os::raw::c_float; 12usize],
}
#[test]
fn bindgen_test_layout_HAL_JoystickAxes() {
    assert_eq!(::std::mem::size_of::<HAL_JoystickAxes>() , 52usize , concat !
               ( "Size of: " , stringify ! ( HAL_JoystickAxes ) ));
    assert_eq! (::std::mem::align_of::<HAL_JoystickAxes>() , 4usize , concat !
                ( "Alignment of " , stringify ! ( HAL_JoystickAxes ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const HAL_JoystickAxes ) ) . count as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( HAL_JoystickAxes ) ,
                "::" , stringify ! ( count ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const HAL_JoystickAxes ) ) . axes as * const _
                as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( HAL_JoystickAxes ) ,
                "::" , stringify ! ( axes ) ));
}
impl Clone for HAL_JoystickAxes {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct HAL_JoystickPOVs {
    pub count: i16,
    pub povs: [i16; 12usize],
}
#[test]
fn bindgen_test_layout_HAL_JoystickPOVs() {
    assert_eq!(::std::mem::size_of::<HAL_JoystickPOVs>() , 26usize , concat !
               ( "Size of: " , stringify ! ( HAL_JoystickPOVs ) ));
    assert_eq! (::std::mem::align_of::<HAL_JoystickPOVs>() , 2usize , concat !
                ( "Alignment of " , stringify ! ( HAL_JoystickPOVs ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const HAL_JoystickPOVs ) ) . count as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( HAL_JoystickPOVs ) ,
                "::" , stringify ! ( count ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const HAL_JoystickPOVs ) ) . povs as * const _
                as usize } , 2usize , concat ! (
                "Alignment of field: " , stringify ! ( HAL_JoystickPOVs ) ,
                "::" , stringify ! ( povs ) ));
}
impl Clone for HAL_JoystickPOVs {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct HAL_JoystickButtons {
    pub buttons: u32,
    pub count: u8,
}
#[test]
fn bindgen_test_layout_HAL_JoystickButtons() {
    assert_eq!(::std::mem::size_of::<HAL_JoystickButtons>() , 8usize , concat
               ! ( "Size of: " , stringify ! ( HAL_JoystickButtons ) ));
    assert_eq! (::std::mem::align_of::<HAL_JoystickButtons>() , 4usize ,
                concat ! (
                "Alignment of " , stringify ! ( HAL_JoystickButtons ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const HAL_JoystickButtons ) ) . buttons as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( HAL_JoystickButtons ) ,
                "::" , stringify ! ( buttons ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const HAL_JoystickButtons ) ) . count as *
                const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( HAL_JoystickButtons ) ,
                "::" , stringify ! ( count ) ));
}
impl Clone for HAL_JoystickButtons {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
pub struct HAL_JoystickDescriptor {
    pub isXbox: u8,
    pub type_: u8,
    pub name: [::std::os::raw::c_char; 256usize],
    pub axisCount: u8,
    pub axisTypes: [u8; 12usize],
    pub buttonCount: u8,
    pub povCount: u8,
}
#[test]
fn bindgen_test_layout_HAL_JoystickDescriptor() {
    assert_eq!(::std::mem::size_of::<HAL_JoystickDescriptor>() , 273usize ,
               concat ! ( "Size of: " , stringify ! ( HAL_JoystickDescriptor )
               ));
    assert_eq! (::std::mem::align_of::<HAL_JoystickDescriptor>() , 1usize ,
                concat ! (
                "Alignment of " , stringify ! ( HAL_JoystickDescriptor ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const HAL_JoystickDescriptor ) ) . isXbox as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( HAL_JoystickDescriptor
                ) , "::" , stringify ! ( isXbox ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const HAL_JoystickDescriptor ) ) . type_ as *
                const _ as usize } , 1usize , concat ! (
                "Alignment of field: " , stringify ! ( HAL_JoystickDescriptor
                ) , "::" , stringify ! ( type_ ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const HAL_JoystickDescriptor ) ) . name as *
                const _ as usize } , 2usize , concat ! (
                "Alignment of field: " , stringify ! ( HAL_JoystickDescriptor
                ) , "::" , stringify ! ( name ) ));
    assert_eq! (unsafe {
